src/test/java/com/schneider/example/soa/soapayload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.schneider.com/EnterpriseObjects/EBO/ShipmentQuery/V2" xmlns:v1="http://xmlns.schneider.com/EnterpriseObjects/Core/Common/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:QueryShipmentListRequestEBM>
         <v1:SNIHeader>
            <v1:MessageID>?</v1:MessageID>
            <v1:MessageName>?</v1:MessageName>
            <!--Optional:-->
            <v1:BusinessKey>?</v1:BusinessKey>
            <!--Optional:-->
            <v1:SessionID>?</v1:SessionID>
            <v1:CreatedDateTime>?</v1:CreatedDateTime>
            <!--Optional:-->
            <v1:RequestMessageID>?</v1:RequestMessageID>
            <!--Optional:-->
            <v1:Sender>
               <!--Optional:-->
               <v1:Name>?</v1:Name>
               <!--Optional:-->
               <v1:ApplicationName>?</v1:ApplicationName>
               <!--Optional:-->
               <v1:HostName>?</v1:HostName>
               <!--Optional:-->
               <v1:InstanceID>?</v1:InstanceID>
               <!--Optional:-->
               <v1:UserID>?</v1:UserID>
            </v1:Sender>
            <!--Optional:-->
            <v1:Target>
               <!--Optional:-->
               <v1:Name>?</v1:Name>
               <!--Optional:-->
               <v1:ApplicationName>?</v1:ApplicationName>
               <!--Optional:-->
               <v1:EndPointURI>?</v1:EndPointURI>
            </v1:Target>
            <!--Optional:-->
            <v1:HeaderExtension>
               <!--Zero or more repetitions:-->
               <v1:Value Name="?">?</v1:Value>
            </v1:HeaderExtension>
         </v1:SNIHeader>
         <v2:DataArea>
            <v2:QueryShipmentListRequestItem>
               <v2:ShipmentStartDateTime>2017-03-14</v2:ShipmentStartDateTime>
               <v2:ShipmentEndDateTime>2017-03-20</v2:ShipmentEndDateTime>
               <!--Optional:-->
               <v2:DriverId>364822</v2:DriverId>
               <!--Optional:-->
               <v2:PowerUnitId></v2:PowerUnitId>
               <!--Optional:-->
               <v2:EquipmentId></v2:EquipmentId>
               <!--Optional:-->
               <v2:LineOfBusiness></v2:LineOfBusiness>
            </v2:QueryShipmentListRequestItem>
         </v2:DataArea>
      </v2:QueryShipmentListRequestEBM>
   </soapenv:Body>
</soapenv:Envelope>